# Atividade 3
Crie um dataframe igual a imagem
Usando o dataframe criado, imprima o nome das colunas dele
Remova uma falta de todos os alunos
Filtre o dataframe para mostrar os alunos sem faltas
Crie uma Serie nova com a média de cada aluno

Opcional:
Adicione a uma nova coluna com as médias no dataframe
Filtre o dataframe para mostrar os alunos que tiraram média maior que 8 ou alunos sem faltas

In [1]:
import pandas as pd
import numpy as np

In [6]:
tabela = pd.DataFrame({
    'Aluno' :["Victor", "Joyce", "Felipe", "Carol", "Maria"],
    'Faltas' : [3,4,2,1,4],
    'Prova' : [2,7,5,10,6],
    'Seminario': [8.5,7.5,9.0,7.5,8.0]
})
tabela

    Aluno  Faltas  Prova  Seminario
0  Victor       3      2        8.5
1   Joyce       4      7        7.5
2  Felipe       2      5        9.0
3   Carol       1     10        7.5
4   Maria       4      6        8.0

In [10]:
tabela["Faltas"] = tabela["Faltas"] - 1
tabela

    Aluno  Faltas  Prova  Seminario
0  Victor       2      2        8.5
1   Joyce       3      7        7.5
2  Felipe       1      5        9.0
3   Carol       0     10        7.5
4   Maria       3      6        8.0

In [14]:
tabela[tabela["Faltas"] == 0 ]

   Aluno  Faltas  Prova  Seminario
3  Carol       0     10        7.5

In [23]:
media = (tabela["Prova"] + tabela["Seminario"])/2
tabela["Media"] = media
tabela

    Aluno  Faltas  Prova  Seminario  Media
0  Victor       2      2        8.5   5.25
1   Joyce       3      7        7.5   7.25
2  Felipe       1      5        9.0   7.00
3   Carol       0     10        7.5   8.75
4   Maria       3      6        8.0   7.00

In [28]:
tabela[(tabela["Media"] > 8) | (tabela["Faltas"] == 0)]

   Aluno  Faltas  Prova  Seminario  Media
3  Carol       0     10        7.5   8.75